import React from "react";
import LetterPaper from "@/pages/RollingpaperPage/components/LetterPaper";
import { BrowserRouter } from "react-router-dom";

export default {
  component: LetterPaper,
  title: "components/RollingpaperPage/LetterPaper",
};

const Template = (args) => {
  return (
    <BrowserRouter>
      <LetterPaper {...args}></LetterPaper>
    </BrowserRouter>
  );
};

export const Default = Template.bind({});
Default.args = {
  to: "소피아",
  messageList: [
    {
      content:
        "얼마나 있을 뜨거운지라, 꽃이 눈이 수 보이는 교향악이다. 가는 남는 위하여, 것이다. 그들의 꾸며 목숨을 그러므로 피가 우리 이상은 하였으며, 천고에 이것이다. 그들에게 보내는 인도하겠다는 보라. 내려온 영락과 어디 끝까지 미인을 옷을 있음으로써 못할 하여도 것이다. 크고 이상은 미묘한 우리 봄바람이다. 봄바람을 위하여서, 있으며, 반짝이는 인생의 피다. 그들은 아름답고 얼마나 그리하였는가? 사라지지 뭇 피가 그들을 것이다.",
      from: "도리",
      authorId: 123,
      color: "#C5FF98",
    },
    {
      content:
        "방황하였으며, 있는 얼음 풍부하게 아름답고 길지 작고 앞이 눈이 쓸쓸하랴? 같이, 오아이스도 물방아 꽃 것은 천자만홍이 하는 하여도 뜨고, 있는가? 인도하겠다는 천고에 밝은 따뜻한 인생의 속잎나고, 봄날의 불러 말이다. 이상은 이상의 웅대한 그들의 아름다우냐? 청춘에서만 무엇을 모래뿐일 이것이다. 아니한 맺어, 무엇이 구하지 그림자는 그들의 보라. 방황하였으며, 장식하는 그들에게 고행을 봄바람이다. 꽃이 타오르고 그들을 듣는다. 갑 앞이 밥을 실로 것은 바로 하는 미인을 이 봄바람이다. 낙원을 노래하며 싹이 봄바람이다. 가치를 가진 우리 인생의 원대하고, 구하기 힘차게 이상의 사막이다.",
      from: "도리",
      authorId: 123,
      color: "#FF8181",
    },
    {
      content:
        "만물은 별과 어디 용감하고 것이다. 오직 희망의 낙원을 그러므로 때문이다. 있음으로써 힘차게 것은 그것은 쓸쓸한 인간의 고행을 스며들어 싸인 사막이다. 아니더면, 이상의 싸인 천고에 황금시대의 힘있다. 청춘에서만 목숨을 못할 이 아니한 영락과 그들은 몸이 칼이다. 못할 들어 시들어 따뜻한 이상이 운다. 가진 청춘의 청춘의 간에 주는 천자만홍이 있으랴? 가슴이 그림자는 가진 끓는 따뜻한 고행을 내는 인간이 것이다. 새가 거친 하는 사막이다. 옷을 든 설레는 있는 피가 인류의 심장의 사막이다.",
      from: "도리",
      authorId: 123,
      color: "#FFF598",
    },
    {
      content:
        "계절이 나는 멀리 있습니다. 부끄러운 이름자를 지나가는 있습니다. 하나에 이웃 별 까닭입니다. 보고, 못 밤이 이런 자랑처럼 위에 쓸쓸함과 별 지나고 있습니다.",
      from: "도리",
      authorId: 123,
      color: "#98DAFF",
    },
    {
      content:
        "하나 별 말 나의 밤을 이름을 계십니다. 밤이 때 비둘기, 가슴속에 청춘이 까닭이요, 하나의 하나에 듯합니다. 시인의 불러 하늘에는 이름과, 이름과, 봅니다.",
      from: "도리",
      authorId: 123,
      color: "#98A2FF",
    },
    {
      content:
        "이국 위에도 것은 애기 별 헤일 된 봅니다. 같이 보고, 없이 언덕 된 하나의 하나에 까닭입니다.",
      from: "도리",
      authorId: 123,
      color: "#FF98D0",
    },
    {
      content:
        "하나에 벌레는 계집애들의 너무나 그리워 노새, 별들을 추억과 거외다. 된 어머니, 아직 별빛이 봅니다. 별이 나의 추억과 없이 덮어 마리아 부끄러운 많은 가슴속에 거외다. 차 가을 남은 하나의 소학교 별 까닭입니다. 이제 가을로 사랑과 하나에 이름자를 봅니다. 프랑시스 어머니, 시와 하나에 아이들의 듯합니다. 많은 별들을 이름자 어머니, 애기 파란 다 아직 까닭이요, 거외다.",
      from: "도리",
      authorId: 123,
      color: "#C5FF98",
    },
    {
      content:
        "이름과, 하늘에는 둘 봅니다. 하늘에는 언덕 가슴속에 멀리 오는 둘 하나에 별이 있습니다. 없이 시와 않은 이름과 가슴속에 피어나듯이 계집애들의 내린 아직 듯합니다. 패, 당신은 별 없이 사랑과 무엇인지 겨울이 그러나 이름을 까닭입니다. 우는 지나고 언덕 새워 오면 다 어머니, 봅니다. 이름과, 마리아 하나에 옥 새워 말 둘 헤는 버리었습니다.",
      from: "도리",
      authorId: 123,
      color: "#FF8181",
    },
    {
      content:
        "오면 어머니, 별을 가을 많은 다 써 까닭입니다. 파란 릴케 때 토끼, 보고, 무엇인지 봅니다. 북간도에 어머님, 이름을 다 봅니다. 시인의 옥 멀듯이, 봅니다. 밤이 사람들의 오면 어머님, 아이들의 하나에 듯합니다. 비둘기, 가득 나는 위에 슬퍼하는 말 하나의 때 있습니다. 이국 경, 지나가는 새워 듯합니다.",
      from: "도리",
      authorId: 123,
      color: "#FFF598",
    },
    {
      content:
        "하나에 벌레는 계집애들의 너무나 그리워 노새, 별들을 추억과 거외다. 된 어머니, 아직 별빛이 봅니다. 별이 나의 추억과 없이 덮어 마리아 부끄러운 많은 가슴속에 거외다. 차 가을 남은 하나의 소학교 별 까닭입니다. 이제 가을로 사랑과 하나에 이름자를 봅니다. 프랑시스 어머니, 시와 하나에 아이들의 듯합니다. 많은 별들을 이름자 어머니, 애기 파란 다 아직 까닭이요, 거외다.",
      from: "도리",
      authorId: 123,
      color: "#98DAFF",
    },
    {
      content:
        "이름과, 하늘에는 둘 봅니다. 하늘에는 언덕 가슴속에 멀리 오는 둘 하나에 별이 있습니다. 없이 시와 않은 이름과 가슴속에 피어나듯이 계집애들의 내린 아직 듯합니다. 패, 당신은 별 없이 사랑과 무엇인지 겨울이 그러나 이름을 까닭입니다. 우는 지나고 언덕 새워 오면 다 어머니, 봅니다. 이름과, 마리아 하나에 옥 새워 말 둘 헤는 버리었습니다.",
      from: "도리",
      authorId: 123,
      color: "#98A2FF",
    },
    {
      content:
        "오면 어머니, 별을 가을 많은 다 써 까닭입니다. 파란 릴케 때 토끼, 보고, 무엇인지 봅니다. 북간도에 어머님, 이름을 다 봅니다. 시인의 옥 멀듯이, 봅니다. 밤이 사람들의 오면 어머님, 아이들의 하나에 듯합니다. 비둘기, 가득 나는 위에 슬퍼하는 말 하나의 때 있습니다. 이국 경, 지나가는 새워 듯합니다.",
      from: "도리",
      authorId: 123,
      color: "#FF98D0",
    },
  ],
};
